#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-304108/artifactregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-304108/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2024l-304108-data]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2024l-304108-code]
data.google_client_config.provider: Reading...
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-304108"/regions/"europe-west1"/zones/<null>]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2024l-304108-code-spark-job.py]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-304108/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-304108/regions/europe-west1/routers/nat-router]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-304108/global/firewalls/default-internal-allow-all]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-304108/regions/europe-west1/subnetworks/subnet-01]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-304108/global/firewalls/allow-all-internal]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-304108/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-304108/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-304108/dataproc.googleapis.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2024l-304108/composer.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2024l-304108/serviceAccounts/tbd-2024l-304108-data@tbd-2024l-304108.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2024l-304108/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2024l-304108/roles/composer.worker/serviceAccount:tbd-2024l-304108-data@tbd-2024l-304108.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2024l-304108/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-304108-data@tbd-2024l-304108.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2024l-304108-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-304108-data@tbd-2024l-304108.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2024l-304108/roles/dataproc.editor/serviceAccount:tbd-2024l-304108-data@tbd-2024l-304108.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2024l-304108-data/roles/storage.objectUser/serviceAccount:tbd-2024l-304108-data@tbd-2024l-304108.iam.gserviceaccount.com]
module.composer.module.composer.data.google_project.project: Reading...
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-304108/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-304108/regions/europe-west1/clusters/tbd-cluster]
module.composer.module.composer.data.google_project.project: Read complete after 1s [id=projects/tbd-2024l-304108]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2024l-304108/roles/composer.ServiceAgentV2Ext/serviceAccount:service-922680384703@cloudcomposer-accounts.iam.gserviceaccount.com]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:7b884ce6c9c688dc56bd090db573cf6c35ca71fada44ac4d55df2d3d73272cc7eu.gcr.io/tbd-2024l-304108/jupyter:3.6.3]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-304108/notebooks.googleapis.com]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-304108-conf]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-304108/roles/iam.serviceAccountTokenCreator]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2024l-304108/locations/europe-west1/environments/demo-lab]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-304108-conf/roles/storage.objectViewer]
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-44c32b0f-bucket-dags/data-dag.py]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-44c32b0f-bucket-dags/dbt-dag.py]
data.google_container_cluster.composer-gke-cluster: Reading...
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:144e0370fe390aa03d68252a7213c9c55a8b9e70fa70c797097667be6008f80beu.gcr.io/tbd-2024l-304108/dbt:1.7.3]
data.google_container_cluster.composer-gke-cluster: Read complete after 3s [id=projects/tbd-2024l-304108/locations/europe-west1/clusters/europe-west1-demo-lab-44c32b0f-gke]
kubernetes_service.dbt-task-service: Refreshing state... [id=composer-user-workloads/dbt-task-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id       = "sha256:144e0370fe390aa03d68252a7213c9c55a8b9e70fa70c797097667be6008f80beu.gcr.io/tbd-2024l-304108/dbt:1.7.3"
      - name     = "eu.gcr.io/tbd-2024l-304108/dbt:1.7.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:7b884ce6c9c688dc56bd090db573cf6c35ca71fada44ac4d55df2d3d73272cc7eu.gcr.io/tbd-2024l-304108/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2024l-304108/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster must be replaced
-/+ resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      ~ effective_labels              = {
          - "goog-dataproc-autozone"     = "enabled"
          - "goog-dataproc-cluster-name" = "tbd-cluster"
          - "goog-dataproc-cluster-uuid" = "71158078-2e95-4562-8dfe-879f0ceaba9c"
          - "goog-dataproc-location"     = "europe-west1"
        } -> (known after apply)
      ~ id                            = "projects/tbd-2024l-304108/regions/europe-west1/clusters/tbd-cluster" -> (known after apply)
      - labels                        = {} -> null
        name                          = "tbd-cluster"
      ~ terraform_labels              = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ cluster_config {
          ~ bucket      = "dataproc-staging-europe-west1-922680384703-v9pjhmqm" -> (known after apply)
          ~ temp_bucket = "dataproc-temp-europe-west1-922680384703-v8phiiyh" -> (known after apply)

          ~ endpoint_config {
              ~ enable_http_port_access = false -> true # forces replacement
              ~ http_ports              = {} -> (known after apply)
            }

          ~ gce_cluster_config {
              + network                = (known after apply)
              ~ service_account_scopes = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> (known after apply)
              ~ subnetwork             = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-304108/regions/europe-west1/subnetworks/subnet-01" -> "projects/tbd-2024l-304108/regions/europe-west1/subnetworks/subnet-01"
              - tags                   = [] -> null
              ~ zone                   = "europe-west1-d" -> "europe-west1-b" # forces replacement
                # (2 unchanged attributes hidden)

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = true -> null
                  - enable_vtpm                 = true -> null
                }
            }

          ~ master_config {
              ~ image_uri        = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-1-ubu20-20231001-111635-rc01" -> (known after apply)
              ~ instance_names   = [
                  - "tbd-cluster-m",
                ] -> (known after apply)
              ~ machine_type     = "e2-standard-2" -> "e2-standard-4" # forces replacement
              ~ min_cpu_platform = "AUTOMATIC" -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ disk_config {
                  ~ num_local_ssds    = 0 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ preemptible_worker_config {
              ~ instance_names = [] -> (known after apply)
              ~ num_instances  = 0 -> 1
              + preemptibility = "PREEMPTIBLE" # forces replacement

              ~ disk_config {
                  + boot_disk_size_gb = 30 # forces replacement
                  + boot_disk_type    = "pd-standard" # forces replacement
                  + num_local_ssds    = (known after apply)
                }

              ~ instance_flexibility_policy {
                  ~ instance_selection_results = [] -> (known after apply)

                  + instance_selection_list { # forces replacement
                      + machine_types = [ # forces replacement
                          + "e2-standard-2",
                        ]
                      + rank          = 1 # forces replacement
                    }
                }
            }

          ~ software_config {
              - optional_components = [] -> null
              - override_properties = {} -> null
              ~ properties          = {
                  - "capacity-scheduler:yarn.scheduler.capacity.root.default.ordering-policy"                 = "fair"
                  - "core:fs.gs.block.size"                                                                   = "134217728"
                  - "core:fs.gs.metadata.cache.enable"                                                        = "false"
                  - "core:hadoop.ssl.enabled.protocols"                                                       = "TLSv1,TLSv1.1,TLSv1.2"
                  - "distcp:mapreduce.map.java.opts"                                                          = "-Xmx576m"
                  - "distcp:mapreduce.map.memory.mb"                                                          = "768"
                  - "distcp:mapreduce.reduce.java.opts"                                                       = "-Xmx576m"
                  - "distcp:mapreduce.reduce.memory.mb"                                                       = "768"
                  - "hadoop-env:HADOOP_DATANODE_OPTS"                                                         = "-Xmx512m"
                  - "hdfs:dfs.datanode.address"                                                               = "0.0.0.0:9866"
                  - "hdfs:dfs.datanode.http.address"                                                          = "0.0.0.0:9864"
                  - "hdfs:dfs.datanode.https.address"                                                         = "0.0.0.0:9865"
                  - "hdfs:dfs.datanode.ipc.address"                                                           = "0.0.0.0:9867"
                  - "hdfs:dfs.namenode.handler.count"                                                         = "20"
                  - "hdfs:dfs.namenode.http-address"                                                          = "0.0.0.0:9870"
                  - "hdfs:dfs.namenode.https-address"                                                         = "0.0.0.0:9871"
                  - "hdfs:dfs.namenode.lifeline.rpc-address"                                                  = "tbd-cluster-m:8050"
                  - "hdfs:dfs.namenode.secondary.http-address"                                                = "0.0.0.0:9868"
                  - "hdfs:dfs.namenode.secondary.https-address"                                               = "0.0.0.0:9869"
                  - "hdfs:dfs.namenode.service.handler.count"                                                 = "10"
                  - "hdfs:dfs.namenode.servicerpc-address"                                                    = "tbd-cluster-m:8051"
                  - "mapred-env:HADOOP_JOB_HISTORYSERVER_HEAPSIZE"                                            = "2048"
                  - "mapred:mapreduce.job.maps"                                                               = "9"
                  - "mapred:mapreduce.job.reduce.slowstart.completedmaps"                                     = "0.95"
                  - "mapred:mapreduce.job.reduces"                                                            = "3"
                  - "mapred:mapreduce.jobhistory.recovery.store.class"                                        = "org.apache.hadoop.mapreduce.v2.hs.HistoryServerLeveldbStateStoreService"
                  - "mapred:mapreduce.map.cpu.vcores"                                                         = "1"
                  - "mapred:mapreduce.map.java.opts"                                                          = "-Xmx2621m"
                  - "mapred:mapreduce.map.memory.mb"                                                          = "3277"
                  - "mapred:mapreduce.reduce.cpu.vcores"                                                      = "1"
                  - "mapred:mapreduce.reduce.java.opts"                                                       = "-Xmx2621m"
                  - "mapred:mapreduce.reduce.memory.mb"                                                       = "3277"
                  - "mapred:mapreduce.task.io.sort.mb"                                                        = "256"
                  - "mapred:yarn.app.mapreduce.am.command-opts"                                               = "-Xmx2621m"
                  - "mapred:yarn.app.mapreduce.am.resource.cpu-vcores"                                        = "1"
                  - "mapred:yarn.app.mapreduce.am.resource.mb"                                                = "3277"
                  - "spark-env:SPARK_DAEMON_MEMORY"                                                           = "2048m"
                  - "spark:spark.driver.maxResultSize"                                                        = "1024m"
                  - "spark:spark.driver.memory"                                                               = "2048m"
                  - "spark:spark.executor.cores"                                                              = "1"
                  - "spark:spark.executor.instances"                                                          = "2"
                  - "spark:spark.executor.memory"                                                             = "2893m"
                  - "spark:spark.executorEnv.OPENBLAS_NUM_THREADS"                                            = "1"
                  - "spark:spark.scheduler.mode"                                                              = "FAIR"
                  - "spark:spark.sql.cbo.enabled"                                                             = "true"
                  - "spark:spark.ui.port"                                                                     = "0"
                  - "spark:spark.yarn.am.memory"                                                              = "640m"
                  - "yarn-env:YARN_NODEMANAGER_HEAPSIZE"                                                      = "819"
                  - "yarn-env:YARN_RESOURCEMANAGER_HEAPSIZE"                                                  = "2048"
                  - "yarn-env:YARN_TIMELINESERVER_HEAPSIZE"                                                   = "2048"
                  - "yarn:yarn.nodemanager.address"                                                           = "0.0.0.0:8026"
                  - "yarn:yarn.nodemanager.resource.cpu-vcores"                                               = "2"
                  - "yarn:yarn.nodemanager.resource.memory-mb"                                                = "6554"
                  - "yarn:yarn.resourcemanager.decommissioning-nodes-watcher.decommission-if-no-shuffle-data" = "true"
                  - "yarn:yarn.resourcemanager.nodemanager-graceful-decommission-timeout-secs"                = "86400"
                  - "yarn:yarn.scheduler.maximum-allocation-mb"                                               = "6554"
                  - "yarn:yarn.scheduler.minimum-allocation-mb"                                               = "1"
                } -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ worker_config {
              ~ image_uri         = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-1-ubu20-20231001-111635-rc01" -> (known after apply)
              ~ instance_names    = [
                  - "tbd-cluster-w-0",
                  - "tbd-cluster-w-1",
                ] -> (known after apply)
              ~ machine_type      = "e2-standard-2" -> "e2-standard-4" # forces replacement
              ~ min_cpu_platform  = "AUTOMATIC" -> (known after apply)
              ~ min_num_instances = 0 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ disk_config {
                  ~ num_local_ssds    = 0 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-304108/dbt:1.7.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "fdd0fa7a7674270f3aa97c3abd965dbadbd4683b"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.3"
              + "PROJECT_NAME"      = "tbd-2024l-304108"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/dbt_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-304108/dbt:latest",
            ]
        }
    }

  # module.dbt_docker_image.docker_registry_image.dbt will be created
  + resource "docker_registry_image" "dbt" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "eu.gcr.io/tbd-2024l-304108/dbt:1.7.3"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha1" = "fdd0fa7a7674270f3aa97c3abd965dbadbd4683b"
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-304108/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.3"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2024l-304108"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/jupyter_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-304108/jupyter:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_registry_image.jupyterlab will be created
  + resource "docker_registry_image" "jupyterlab" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "eu.gcr.io/tbd-2024l-304108/jupyter:3.6.3"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-304108"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook will be created
  + resource "google_notebooks_instance" "tbd_notebook" {
      + create_time            = (known after apply)
      + desired_state          = "ACTIVE"
      + disk_encryption        = (known after apply)
      + effective_labels       = (known after apply)
      + id                     = (known after apply)
      + instance_owners        = [
          + "marek.wiewiorka@gmail.com",
        ]
      + location               = "europe-west1-b"
      + machine_type           = "e2-standard-4"
      + metadata               = {
          + "notebook-disable-root" = "true"
          + "vmDnsSetting"          = "GlobalDefault"
        }
      + name                   = "tbd-2024l-304108-notebook"
      + network                = "projects/tbd-2024l-304108/global/networks/main-vpc"
      + no_proxy_access        = true
      + no_public_ip           = true
      + post_startup_script    = "gs://tbd-2024l-304108-conf/scripts/notebook_post_startup_script.sh"
      + project                = "tbd-2024l-304108"
      + proxy_uri              = (known after apply)
      + service_account        = (known after apply)
      + service_account_scopes = (known after apply)
      + state                  = (known after apply)
      + subnet                 = "projects/tbd-2024l-304108/regions/europe-west1/subnetworks/subnet-01"
      + tags                   = (known after apply)
      + terraform_labels       = (known after apply)
      + update_time            = (known after apply)

      + container_image {
          + repository = "eu.gcr.io/tbd-2024l-304108/jupyter"
          + tag        = "3.6.3"
        }

      + shielded_instance_config {
          + enable_integrity_monitoring = true
          + enable_secure_boot          = true
          + enable_vtpm                 = true
        }
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-304108/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:922680384703-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-304108-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:922680384703-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_object.post-startup will be created
  + resource "google_storage_bucket_object" "post-startup" {
      + bucket         = "tbd-2024l-304108-conf"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "scripts/notebook_post_startup_script.sh"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/vertex-ai-workbench/resources/notebook_post_startup_script.sh"
      + storage_class  = (known after apply)
    }

Plan: 7 to add, 2 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Dove6, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*